{
    "msg": "\n     \n   \nThe Security Interest Group is a forum for vendors and developers to discuss\nthe state of standardization and development agendas for security technologies\nacross all the various venues for standardization.\n\nThe inaugural meeting is May 24th, to be held simultaneously 8AM-4PM PST at\nOracle in Redwood Shores, and 11AM-7PM at MIT/LCS with audio- and\nweb-conferencing.\n\nThis mailing list is public, though not publicized. Anyone may subscribe, and\na web-based archive is at http://www.w3.org/pub/WWW/Archives/Public/sig/ .\nSend the command \"subscribe [email]\" or \"unsubscribe [email]\" in the Subject\nline or body of a message to sig-request@w3.org.\n\nThanks,\nRohit Khare\n\n---\nRohit Khare -- 617/253-5884\nTechnical Staff, World Wide Web Consortium\nNE43-354, MIT LCS, Cambridge, MA 02139\n\n\n\n     \n   \nProposed Agenda:\n----------------\n7:30        Breakfast (Brunch)\n\n8-10        Introductions; top priority issues summary.\n\n10-10:30    Jeff Schiller, IETF Overview\n10:30-11    Jim Miller, W3C Overview\n11-11:30    [TBD: Burt Kaliski, PKCS Futures or SDSI]\n11:30-12:30 Roundtable: X.509v3 and CA stds issues\n\n12:30-1:30  Lunch (Snack)\n\n1:30-2:30   Proposed merger of priority lists\n2:30-3:30   Mapping tasks to fora and available resources\n3:30-4      Plotting next meeting, press release review\n\nHomework Questions:\n-------------------\nCompany representatives must be prepared to outline their top prioirty issues\nin the introduction sessions. Participants should also think through their\nbusiness requirements, technological needs, available resources, and\nappropriate fora for standardization.\n\nMore detailed guidelines will be sent out soon.\n\n\nWest Coast Site:\n----------------\nOracle Corporation\n200 Oracle Parkway, Box 659410\nRedwood Shores, CA  94065\nHost: Paul Lambert\nEmail: palamber@us.oracle.com\nPhone: (415) 506-0370\n\n\nEast Coast Site:\n----------------\nMIT/W3 Consortium\n545 Technology Square\nCambridge, MA 02139\nHost: Rohit Khare       (RSVPs REQUIRED!)\nEmail: khare@w3.org\nPhone: (617) 253-5884\n\n---\nRohit Khare -- 617/253-5884\nTechnical Staff, World Wide Web Consortium\nNE43-354, MIT LCS, Cambridge, MA 02139\n     \n   \n\n\n     \n   \nSECURITY SPECIAL INTEREST GROUP CHARTER\n\nBACKGROUND\n\nInadequate security is inhibiting customer use of network computing\n(whether on the Internet or Intranet). Solving this complex,\nmulti-faceted problem quickly and effectively is critical to the\ncontinued growth of the computing industry and other industries which\nrely on computing to deliver customer solutions.  The solution must\ninvolve standards in order to meet customer requirements for\ninteroperable products and flexibility to deploy a mix of products.\nWorking groups and standards organizations are already addressing some\nspecific aspects of security.  Commercial organizations are rapidly\ngenerating new approaches and tackling new security problems.  In order\nto quickly meet the demands of the market place for interoperable,\nflexible solutions, it is useful to ensure that the various efforts are\nconsistently coordinated.  To facilitate establishment of security\nstandards, a number of companies are joining to form a Security Special\nInterest Group.\n\nSECURITY SPECIAL INTEREST GROUP CHARTER AND ACTIVITIES\n\nThe mission of the Security Special Interest Group is to define the\ncritical security problems that require establishment of technical\nstandards, and aid the appropriate working groups and standards\norganizations in establishing standards that will help solve critical\nsecurity problems.\n\nSpecifically, the Security Special Interest Group will:\n\n* compile a list of security problems that are of significant\ncommercial interest\n* identify the technology components required to solve those problems\n* identify dependencies between technology components to aid\nprioritization\n* summarize the status of each technology component.\n\nFor example, whether the technology is already being considered by\nstandards organizations and if so which working group(s) are\nconsidering, whether there will be additional proposals submitted,\nstage of development, the interoperability requirements between\ndifferent technologies, and the range of customer requirements for each\ntechnology (eg, strength of encryption versus speed and exportability).\n* organize the technology components into logical sets and identify the\namount and type of work required to advance each technology set to a\nlevel where it can be submitted for consideration as a standard.\n\n* submit a recommendation to appropriate working groups and standards\n organizations (eg, W3C, IETF) suggesting which group should address\neach item in the work list.  Both the W3C and the IETF will have\nrepresentation at the SIG.\n* provide technical resources to aid working group efforts.\n\nThe Security Special Interest Group will not write specifications or\nperform technical review of specifications.  Members should submit\ndraft specifications on a particular technology directly to the\nspecific organizations cited in the SIG recommendation.\n\nSECURITY SPECIAL INTEREST GROUP ORGANIZATION AND OPERATIONS\n\nThe Security Special Interest Group will have an open membership policy\nand no dues.  The only requirements for participation are (1) that the\nmember companies are members of the W3C and have engineers working on\nsecurity who are also members of the IETF; and (2) that the member\ncompanies submit a list of technical resources (a minimum of one person\nfor each technology component in which the company has an interest)\nthey are willing to assign to working groups that address the work\nitems defined by the SIG.  The SIG will maintain a mailing list and\ndiscussion forum to inform members of upcoming meetings and enable\ndiscussion of issues being addressed by the SIG.  It will meet as\nneeded by agreement of the members.  It may conduct additional\nactivities as agreed upon by the members.  The first meeting will take\nplace in late May.\n\nHOW TO JOIN THE SECURITY SPECIAL INTEREST GROUP\n\nTo be on the mailing list, send the command \"subscribe [email]\" in the\nSubject line or body of a message to sig-request@w3.org.\n     \n   \n\n",
    "receivers": [
        " sig@w3.org\n",
        " hal@mit.edu",
        " timBL@w3.org\n"
    ],
    "sender": "\"khare@pest.w3.org\"\n",
    "sent": "\"Fri, 17 May 96 17:14:29 -0400\"\n",
    "subject": "\"SIG Charter (Proposed)\"\n"
}